In [4]:
import numpy as np
import pandas as pd

# eksik veriler

In [7]:
sozluk = {"Istanbul" : [30,20,np.nan], "Ankara" : [20,np.nan,25], "Izmir" : [40,39,34]}
hdDataframe = pd.DataFrame(sozluk)

In [8]:
hdDataframe

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     34

In [9]:
#nan olanları sılme

In [11]:
yenisozluk = {"Istanbul" : [30,20,np.nan], "Ankara" : [20,np.nan,25], "Izmir" : [40,39,34], "Antalya" : [37,np.nan,np.nan]}
yeniDataframe = pd.DataFrame(yenisozluk)

In [12]:
yeniDataframe

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     37.0
1      20.0     NaN     39      NaN
2       NaN    25.0     34      NaN

In [14]:
yeniDataframe.dropna(axis = 1,thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     34

In [15]:
yeniDataframe.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     37.0
1      20.0    20.0     39     20.0
2      20.0    25.0     34     20.0

# groupBy

In [23]:
maassozlukgu = {"Departman" : ["Yazilim","Yazilim","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calisan ismi" : ["Ahmet","Zeynep","Asli","Burak","Hakan","Fatma"],
               "Maas" : [1500,2500,2000,3000,3600,1800]}

In [24]:
maasDataFrame = pd.DataFrame(maassozlukgu)

In [25]:
maasDataFrame

   Departman Calisan ismi  Maas
0    Yazilim        Ahmet  1500
1    Yazilim       Zeynep  2500
2  Pazarlama         Asli  2000
3  Pazarlama        Burak  3000
4      Hukuk        Hakan  3600
5      Hukuk        Fatma  1800

In [26]:
groupobjesi = maasDataFrame.groupby("Departman")

In [29]:
groupobjesi.count()

           Calisan ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazilim               2     2

In [32]:
groupobjesi.min()

          Calisan ismi  Maas
Departman
Hukuk            Fatma  1800
Pazarlama         Asli  2000
Yazilim          Ahmet  1500

In [33]:
groupobjesi.max()

          Calisan ismi  Maas
Departman
Hukuk            Hakan  3600
Pazarlama        Burak  3000
Yazilim         Zeynep  2500

In [35]:
groupobjesi.describe()

           Maas
          count    mean          std     min     25%     50%     75%     max
Departman
Hukuk       2.0  2700.0  1272.792206  1800.0  2250.0  2700.0  3150.0  3600.0
Pazarlama   2.0  2500.0   707.106781  2000.0  2250.0  2500.0  2750.0  3000.0
Yazilim     2.0  2000.0   707.106781  1500.0  1750.0  2000.0  2250.0  2500.0